{
  "architectures": [
    "ResNetForImageClassification"
  ],
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsample_in_bottleneck": false,
  "downsample_in_first_stage": false,
  "embedding_size": 64,
  "hidden_act": "relu",
  "hidden_sizes": [
    256,
    512,
    1024,
    2048
  ],
  "id2label": {
    "0": "AirPods",
    "1": "Android_phone",
    "2": "CD_player",
    "3": "DVD_player",
    "4": "Lightning_cable",
    "5": "TV_remote_control",
    "6": "USB-C_cable",
    "7": "air_freshener_dispenser",
    "8": "air_fryer",
    "9": "blood_pressure_monitor",
    "10": "bluetooth_speaker",
    "11": "calculator",
    "12": "car_charger",
    "13": "computer_mouse",
    "14": "digital_thermometer",
    "15": "electric_fan",
    "16": "electric_kettle",
    "17": "electric_toothbrush",
    "18": "fitness_tracker",
    "19": "food_scale",
    "20": "hair_dryer",
    "21": "hand_mixer",
    "22": "headphones",
    "23": "iPhone",
    "24": "iPhone_charger",
    "25": "juicer",
    "26": "kitchen_blender",
    "27": "laptop_charger",
    "28": "laptop_computer",
    "29": "mechanical_keyboard",
    "30": "micro_USB_cable",
    "31": "microwave",
    "32": "nail_clipper",
    "33": "phone_charger",
    "34": "power_bank",
    "35": "printer",
    "36": "scanner",
    "37": "security_camera",
    "38": "smart_light_bulb",
    "39": "smart_speaker",
    "40": "smartwatch",
    "41": "soundbar",
    "42": "stand_mixer",
    "43": "toaster",
    "44": "vacuum_cleaner",
    "45": "weighing_scale",
    "46": "wifi_router",
    "47": "wireless_charger",
    "48": "wireless_earbuds",
    "49": "wireless_mouse"
  },
  "label2id": {
    "AirPods": 0,
    "Android_phone": 1,
    "CD_player": 2,
    "DVD_player": 3,
    "Lightning_cable": 4,
    "TV_remote_control": 5,
    "USB-C_cable": 6,
    "air_freshener_dispenser": 7,
    "air_fryer": 8,
    "blood_pressure_monitor": 9,
    "bluetooth_speaker": 10,
    "calculator": 11,
    "car_charger": 12,
    "computer_mouse": 13,
    "digital_thermometer": 14,
    "electric_fan": 15,
    "electric_kettle": 16,
    "electric_toothbrush": 17,
    "fitness_tracker": 18,
    "food_scale": 19,
    "hair_dryer": 20,
    "hand_mixer": 21,
    "headphones": 22,
    "iPhone": 23,
    "iPhone_charger": 24,
    "juicer": 25,
    "kitchen_blender": 26,
    "laptop_charger": 27,
    "laptop_computer": 28,
    "mechanical_keyboard": 29,
    "micro_USB_cable": 30,
    "microwave": 31,
    "nail_clipper": 32,
    "phone_charger": 33,
    "power_bank": 34,
    "printer": 35,
    "scanner": 36,
    "security_camera": 37,
    "smart_light_bulb": 38,
    "smart_speaker": 39,
    "smartwatch": 40,
    "soundbar": 41,
    "stand_mixer": 42,
    "toaster": 43,
    "vacuum_cleaner": 44,
    "weighing_scale": 45,
    "wifi_router": 46,
    "wireless_charger": 47,
    "wireless_earbuds": 48,
    "wireless_mouse": 49
  },
  "layer_type": "bottleneck",
  "model_type": "resnet",
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.55.3"
}
